// 对象：
// 对象的属性是无序的
// 对象的键名的数据类型是字符串或者Symbol


// JSON -> Javascript Object Notation

// 所有编程语言都离不开的三大数据类型
// 1.scalar 标量 「字符串和数字」
// 2.sequence 序列 「数组和列表」
// 3.mapping 映射 「键值对」

// JSON就是使用映射的关系，形成的一种轻量级属性交互的格式

// 1.映射用冒号隔开
// "name": "张三"
// 2.并列数据用逗号隔开
// "name": "张三",
// "age": 18
// 3.映射的集合用{}包裹
// {
//   "name": "张三",
//   "age": 18
// }
// 4.键名要用双引号

// 5.并列数据集合用[]包裹
// [
//   {},
//   {}
// ]

// JSON的由来
// 早期使用XML进行数据交互，数据文档很大，不易读，解析比较复杂

// 在div中配置时对象中的属性要用双引号
// <div data-config = '{"name": "hezi", "age": "18"}'></div>  

// JSON.parse 解析字符串，大括号中要用双引号，不然会报错
// JSON.stringify 将JSON对象变为字符串





